data_analysis/benchmark_lrdt/ycsb/20240519_153312/cluster-default/workload_99_1_mongo/960/1000000/3/transactions_16.dat
/usr/bin/java  -classpath /home/ccamilleri-prest/YCSB/conf:/home/ccamilleri-prest/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/ccamilleri-prest/YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/lrdt/workload_99_1 -p mongodb.url=mongodb+srv://app:Mu8PfKAF9g7mr9yE6wnT@cluster-cms-pot-01-pl-0.mubeh.mongodb.net/u_cmsdb?retryWrites=true&w=majority -threads 60 -p operationcount=10000000 -p fieldlength=100 -p fieldlengthdistribution=constant -p measurementtype=timeseries -p timeseries.granularity=100 -p readrecordcount=1000000 -p updaterecordcount=1000000
mongo client connection created with mongodb+srv://app:Mu8PfKAF9g7mr9yE6wnT@cluster-cms-pot-01-pl-0.mubeh.mongodb.net/u_cmsdb?retryWrites=true&w=majority
[OVERALL], RunTime(ms), 60107
[OVERALL], Throughput(ops/sec), 2632.5885504184207
[TOTAL_GCS_G1_Young_Generation], Count, 5
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 88
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.1464055767215133
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 88
[TOTAL_GC_TIME_%], Time(%), 0.1464055767215133
[READ], Operations, 156640
[READ], AverageLatency(us), 20482.055911644537
[READ], MinLatency(us), 192
[READ], MaxLatency(us), 5449233
[READ], Return=OK, 156645
[READ], 0, 2421474.5625
[READ], 100, 585912.05
[READ], 200, 1034300.5109489051
[READ], 300, 56227.688790560474
[READ], 400, 6914.318318318318
[READ], 500, 6714.1166134185305
[READ], 600, 39673.29508196721
[READ], 700, 9342.133858267716
[READ], 800, 2577.3796610169493
[READ], 900, 4169.557251908397
[READ], 1000, 44274.008849557526
[READ], 1100, 11602.184668989546
[READ], 1200, 17794.69483568075
[READ], 1300, 21499.680911680913
[READ], 1400, 26155.097222222223
[READ], 1500, 24182.035587188613
[READ], 1600, 21969.988326848248
[READ], 1700, 21188.511194029852
[READ], 1800, 16396.798507462685
[READ], 1900, 22975.26274509804
[READ], 2000, 17141.10980392157
[READ], 2100, 28206.522727272728
[READ], 2200, 22069.219424460432
[READ], 2300, 20367.248979591837
[READ], 2400, 23008.181481481482
[READ], 2500, 8766.73488372093
[READ], 2600, 8312.159420289856
[READ], 2700, 12034.927325581395
[READ], 2800, 29980.74418604651
[READ], 2900, 10431.248427672956
[READ], 3000, 15543.283185840708
[READ], 3100, 11647.177914110429
[READ], 3200, 22967.023460410557
[READ], 3300, 17187.422297297297
[READ], 3400, 16057.877952755905
[READ], 3500, 29974.326612903227
[READ], 3600, 20081.609589041094
[READ], 3700, 23070.562189054726
[READ], 3800, 23734.209375
[READ], 3900, 24380.46153846154
[READ], 4000, 20826.25590551181
[READ], 4100, 22038.56015037594
[READ], 4200, 21447.305147058825
[READ], 4300, 20902.229927007298
[READ], 4400, 21311.605263157893
[READ], 4500, 21140.410774410775
[READ], 4600, 19637.860986547086
[READ], 4700, 23661.92883895131
[READ], 4800, 20563.535714285714
[READ], 4900, 21167.294820717132
[READ], 5000, 15132.374384236453
[READ], 5100, 13920.836236933797
[READ], 5200, 19870.495145631066
[READ], 5300, 31805.728222996517
[READ], 5400, 20873.735632183907
[READ], 5500, 19256.26936026936
[READ], 5600, 22603.2375
[READ], 5700, 14340.170212765957
[READ], 5800, 25446.57414448669
[READ], 5900, 22041.475655430713
[READ], 6000, 20532.36431226766
[READ], 6100, 21563.034351145037
[READ], 6200, 21131.897058823528
[READ], 6300, 22338.375478927202
[READ], 6400, 9178.247422680412
[READ], 6500, 6670.4
[READ], 6600, 10704.71484375
[READ], 6700, 57313.60173160173
[READ], 6800, 28745.122807017542
[READ], 6900, 21962.954545454544
[READ], 7000, 13926.24923076923
[READ], 7100, 18698.463855421687
[READ], 7200, 19220.768907563026
[READ], 7300, 5878.971291866029
[READ], 7400, 9132.742243436755
[READ], 7500, 17195.30606060606
[READ], 7600, 26170.782738095237
[READ], 7700, 26631.018604651163
[READ], 7800, 14563.44034090909
[READ], 7900, 8048.7218225419665
[READ], 8000, 14026.824607329843
[READ], 8100, 21042.189516129034
[READ], 8200, 17173.73764258555
[READ], 8300, 20616.801369863013
[READ], 8400, 18796.553571428572
[READ], 8500, 37747.30935251799
[READ], 8600, 23220.579925650556
[READ], 8700, 17957.70909090909
[READ], 8800, 25977.53100775194
[READ], 8900, 21663.681159420288
[READ], 9000, 21490.388679245283
[READ], 9100, 14523.446280991735
[READ], 9200, 5349.379958246346
[READ], 9300, 8820.1335504886
[READ], 9400, 15853.850993377484
[READ], 9500, 21586.476323119776
[READ], 9600, 23246.852459016394
[READ], 9700, 29593.703296703297
[READ], 9800, 32117.131004366813
[READ], 9900, 25965.182795698925
[READ], 10000, 20213.62093862816
[READ], 10100, 18398.780991735537
[READ], 10200, 38852.41954022989
[READ], 10300, 10859.278761061947
[READ], 10400, 19346.40772532189
[READ], 10500, 24144.24104234528
[READ], 10600, 20319.653125
[READ], 10700, 10217.053003533569
[READ], 10800, 34606.99523809524
[READ], 10900, 11751.699745547074
[READ], 11000, 22488.45357142857
[READ], 11100, 18451.479853479854
[READ], 11200, 21817.87118644068
[READ], 11300, 12878.284697508896
[READ], 11400, 28655.4061302682
[READ], 11500, 18574.79061371841
[READ], 11600, 7726.780927835051
[READ], 11700, 20153.22822822823
[READ], 11800, 15910.931407942238
[READ], 11900, 21952.75778546713
[READ], 12000, 25500.18045112782
[READ], 12100, 12182.675276752767
[READ], 12200, 3904.092957746479
[READ], 12300, 32509.435064935064
[READ], 12400, 12976.50974025974
[READ], 12500, 6992.090566037736
[READ], 12600, 13659.648760330578
[READ], 12700, 29418.65156794425
[READ], 12800, 26040.560747663552
[READ], 12900, 32440.548936170213
[READ], 13000, 14100.303797468354
[READ], 13100, 11451.718894009216
[READ], 13200, 35287.67924528302
[READ], 13300, 18626.771043771045
[READ], 13400, 21680.10322580645
[READ], 13500, 20336.928315412188
[READ], 13600, 20200.827464788734
[READ], 13700, 21465.155477031803
[READ], 13800, 22654.715415019764
[READ], 13900, 20987.856603773584
[READ], 14000, 19953.29181494662
[READ], 14100, 21515.303797468354
[READ], 14200, 5038.909698996656
[READ], 14300, 10423.538681948425
[READ], 14400, 58529.36571428571
[READ], 14500, 30569.158415841583
[READ], 14600, 13955.839464882944
[READ], 14700, 4441.441647597254
[READ], 14800, 23851.85714285714
[READ], 14900, 32922.5
[READ], 15000, 18655.49315068493
[READ], 15100, 34057.63953488372
[READ], 15200, 9603.75
[READ], 15300, 28058.593495934958
[READ], 15400, 18066.584507042255
[READ], 15500, 28166.920704845816
[READ], 15600, 18508.633333333335
[READ], 15700, 19327.170305676857
[READ], 15800, 15681.61921708185
[READ], 15900, 23020.86219081272
[READ], 16000, 30997.346846846845
[READ], 16100, 21386.564315352698
[READ], 16200, 18213.975806451614
[READ], 16300, 24350.167832167834
[READ], 16400, 23282.682835820895
[READ], 16500, 21396.590733590732
[READ], 16600, 19513.31818181818
[READ], 16700, 22571.29739776952
[READ], 16800, 6488.679292929293
[READ], 16900, 10747.425855513307
[READ], 17000, 14693.074183976261
[READ], 17100, 19675.522900763357
[READ], 17200, 27852.0
[READ], 17300, 22306.717105263157
[READ], 17400, 27247.98653198653
[READ], 17500, 26240.94537815126
[READ], 17600, 21340.31615120275
[READ], 17700, 21646.51971326165
[READ], 17800, 24903.286363636365
[READ], 17900, 22714.203187250994
[READ], 18000, 21668.604982206405
[READ], 18100, 22318.818897637797
[READ], 18200, 9479.204946996466
[READ], 18300, 12329.383211678833
[READ], 18400, 16248.840579710144
[READ], 18500, 24914.185770750988
[READ], 18600, 28470.464601769912
[READ], 18700, 12161.550321199144
[READ], 18800, 18736.48878923767
[READ], 18900, 15104.37808219178
[READ], 19000, 25862.136150234743
[READ], 19100, 25145.31970260223
[READ], 19200, 21195.5
[READ], 19300, 18300.741379310344
[READ], 19400, 14847.137323943662
[READ], 19500, 7485.053191489362
[READ], 19600, 10877.376119402985
[READ], 19700, 27358.88489208633
[READ], 19800, 40707.117424242424
[READ], 19900, 19416.20987654321
[READ], 20000, 14614.321782178218
[READ], 20100, 39433.180555555555
[READ], 20200, 16469.078602620088
[READ], 20300, 12928.463503649635
[READ], 20400, 15804.319548872181
[READ], 20500, 19990.841836734693
[READ], 20600, 19365.671732522795
[READ], 20700, 33308.577075098816
[READ], 20800, 12702.02487562189
[READ], 20900, 9727.707602339182
[READ], 21000, 16020.360501567398
[READ], 21100, 12351.75965665236
[READ], 21200, 24152.0871559633
[READ], 21300, 64781.83944954129
[READ], 21400, 14034.239543726235
[READ], 21500, 15508.522580645162
[READ], 21600, 16713.951515151515
[READ], 21700, 16947.117647058825
[READ], 21800, 24124.34745762712
[READ], 21900, 29813.714285714286
[READ], 22000, 26186.540322580644
[READ], 22100, 16782.953177257525
[READ], 22200, 23118.737588652482
[READ], 22300, 15723.202429149798
[READ], 22400, 9937.5
[READ], 22500, 18101.71544715447
[READ], 22600, 29471.995951417004
[READ], 22700, 33675.11604095563
[READ], 22800, 19478.147368421054
[READ], 22900, 17217.9359430605
[READ], 23000, 23620.597014925374
[READ], 23100, 16983.490706319702
[READ], 23200, 10669.376344086022
[READ], 23300, 28617.93155893536
[READ], 23400, 17472.068493150684
[READ], 23500, 18058.577777777777
[READ], 23600, 31221.66527196653
[READ], 23700, 19476.191419141913
[READ], 23800, 13761.556497175141
[READ], 23900, 24834.555555555555
[READ], 24000, 19989.874551971327
[READ], 24100, 12755.436201780416
[READ], 24200, 9043.981481481482
[READ], 24300, 21503.27972027972
[READ], 24400, 10266.917647058823
[READ], 24500, 18782.418079096045
[READ], 24600, 21544.07594936709
[READ], 24700, 19579.857664233576
[READ], 24800, 12990.012698412698
[READ], 24900, 8935.615763546799
[READ], 25000, 24748.892156862745
[READ], 25100, 13968.552870090634
[READ], 25200, 37214.07112970711
[READ], 25300, 7756.664576802508
[READ], 25400, 31228.861818181816
[READ], 25500, 23088.738636363636
[READ], 25600, 17621.349775784754
[READ], 25700, 14152.734567901234
[READ], 25800, 28377.30078125
[READ], 25900, 18941.49295774648
[READ], 26000, 25073.074074074073
[READ], 26100, 11486.181102362205
[READ], 26200, 14652.80487804878
[READ], 26300, 23500.10332103321
[READ], 26400, 26806.798245614034
[READ], 26500, 23411.174311926607
[READ], 26600, 19503.81072555205
[READ], 26700, 20757.096296296295
[READ], 26800, 27729.982608695653
[READ], 26900, 19521.24548736462
[READ], 27000, 13196.854166666666
[READ], 27100, 29929.33716475096
[READ], 27200, 18027.65168539326
[READ], 27300, 17420.24406779661
[READ], 27400, 12581.39941690962
[READ], 27500, 17258.432624113477
[READ], 27600, 35832.989304812836
[READ], 27700, 13567.209770114943
[READ], 27800, 18164.208053691276
[READ], 27900, 29115.8125
[READ], 28000, 17215.333333333332
[READ], 28100, 16932.510791366905
[READ], 28200, 18652.48028673835
[READ], 28300, 23110.859090909093
[READ], 28400, 11927.388379204893
[READ], 28500, 5960.116991643454
[READ], 28600, 10875.563685636856
[READ], 28700, 18553.372093023256
[READ], 28800, 17564.77364864865
[READ], 28900, 12083.532828282829
[READ], 29000, 12614.383141762451
[READ], 29100, 13351.633858267716
[READ], 29200, 15153.541114058355
[READ], 29300, 12510.64126984127
[READ], 29400, 32970.098540145984
[READ], 29500, 8003.161125319693
[READ], 29600, 17422.18275862069
[READ], 29700, 17470.68796068796
[READ], 29800, 17085.40928270042
[READ], 29900, 15491.12356321839
[READ], 30000, 32683.917218543047
[READ], 30100, 19286.718543046358
[READ], 30200, 6910.428571428572
[READ], 30300, 9817.050890585242
[READ], 30400, 20275.943319838058
[READ], 30500, 32877.435
[READ], 30600, 24983.750943396226
[READ], 30700, 15289.127272727274
[READ], 30800, 21229.870967741936
[READ], 30900, 22002.637010676157
[READ], 31000, 9652.149122807017
[READ], 31100, 33361.63228699552
[READ], 31200, 15570.059154929577
[READ], 31300, 12838.554347826086
[READ], 31400, 18322.87671232877
[READ], 31500, 23771.244541484717
[READ], 31600, 21337.643097643097
[READ], 31700, 6168.7790055248615
[READ], 31800, 20025.245161290324
[READ], 31900, 45052.936842105264
[READ], 32000, 8958.689095127611
[READ], 32100, 9921.134099616858
[READ], 32200, 20800.678733031673
[READ], 32300, 26002.235849056604
[READ], 32400, 29236.275229357798
[READ], 32500, 16128.368888888888
[READ], 32600, 24451.841628959275
[READ], 32700, 21931.899135446685
[READ], 32800, 20073.0
[READ], 32900, 19934.783783783783
[READ], 33000, 17881.82879377432
[READ], 33100, 20040.32051282051
[READ], 33200, 22258.11693548387
[READ], 33300, 15112.951807228916
[READ], 33400, 26347.18106995885
[READ], 33500, 21512.958448753463
[READ], 33600, 32074.473684210527
[READ], 33700, 6173.512422360249
[READ], 33800, 12100.783505154639
[READ], 33900, 19088.303846153845
[READ], 34000, 21277.33243243243
[READ], 34100, 23093.26582278481
[READ], 34200, 4023.4972067039107
[READ], 34300, 30468.37090909091
[READ], 34400, 20988.882845188284
[READ], 34500, 13141.270886075949
[READ], 34600, 14564.409594095941
[READ], 34700, 8968.089147286822
[READ], 34800, 12499.75
[READ], 34900, 13272.101818181818
[READ], 35000, 14386.855227882037
[READ], 35100, 28539.800675675677
[READ], 35200, 19599.834615384614
[READ], 35300, 29943.470319634704
[READ], 35400, 23899.81052631579
[READ], 35500, 27846.122047244095
[READ], 35600, 24000.2319391635
[READ], 35700, 17201.960784313724
[READ], 35800, 29321.19248826291
[READ], 35900, 19263.989898989897
[READ], 36000, 9069.335877862595
[READ], 36100, 20178.439655172413
[READ], 36200, 19995.954128440368
[READ], 36300, 25941.48502994012
[READ], 36400, 27437.561983471074
[READ], 36500, 7110.70955882353
[READ], 36600, 15269.011428571428
[READ], 36700, 31057.439344262297
[READ], 36800, 18967.569037656904
[READ], 36900, 11273.141592920354
[READ], 37000, 17169.064516129034
[READ], 37100, 19330.24884792627
[READ], 37200, 22441.21189591078
[READ], 37300, 55459.31775700935
[READ], 37400, 14130.35546875
[READ], 37500, 25170.19784172662
[READ], 37600, 24312.692
[READ], 37700, 13369.626168224298
[READ], 37800, 29172.58823529412
[READ], 37900, 22495.380434782608
[READ], 38000, 22107.42635658915
[READ], 38100, 17379.529209621993
[READ], 38200, 12433.847701149425
[READ], 38300, 12806.367697594502
[READ], 38400, 10177.126245847176
[READ], 38500, 15443.832142857143
[READ], 38600, 38482.15625
[READ], 38700, 30043.86046511628
[READ], 38800, 22465.511834319528
[READ], 38900, 21853.167202572346
[READ], 39000, 21295.028806584363
[READ], 39100, 10782.51461988304
[READ], 39200, 23923.790378006874
[READ], 39300, 27049.54418604651
[READ], 39400, 14116.321715817694
[READ], 39500, 19487.54938271605
[READ], 39600, 19454.41947565543
[READ], 39700, 27123.885375494072
[READ], 39800, 15681.023255813954
[READ], 39900, 28350.291866028707
[READ], 40000, 25110.54195804196
[READ], 40100, 19357.7667844523
[READ], 40200, 7669.104438642297
[READ], 40300, 13024.120141342757
[READ], 40400, 30226.474683544304
[READ], 40500, 10366.837758112095
[READ], 40600, 13224.925110132159
[READ], 40700, 17297.428571428572
[READ], 40800, 15213.879032258064
[READ], 40900, 14694.934640522875
[READ], 41000, 20854.72131147541
[READ], 41100, 30834.70260223048
[READ], 41200, 25743.287581699347
[READ], 41300, 26851.582089552237
[READ], 41400, 21616.407563025212
[READ], 41500, 8234.537414965986
[READ], 41600, 28767.486577181207
[READ], 41700, 16056.15243902439
[READ], 41800, 36770.57421875
[READ], 41900, 13715.726804123711
[READ], 42000, 23727.39912280702
[READ], 42100, 30327.51677852349
[READ], 42200, 8149.423255813954
[READ], 42300, 38808.516279069765
[READ], 42400, 44208.968253968254
[READ], 42500, 25191.694029850747
[READ], 42600, 9496.585034013606
[READ], 42700, 11922.49025974026
[READ], 42800, 26337.853146853147
[READ], 42900, 35508.734375
[READ], 43000, 16445.29716981132
[READ], 43100, 18678.27556818182
[READ], 43200, 22744.778145695363
[READ], 43300, 7737.287128712871
[READ], 43400, 18466.95020746888
[READ], 43500, 19349.1953125
[READ], 43600, 14087.877394636016
[READ], 43700, 7264.476534296029
[READ], 43800, 13673.165492957747
[READ], 43900, 10055.315789473685
[READ], 44000, 39477.35042735043
[READ], 44100, 22643.12565445026
[READ], 44200, 25535.029213483147
[READ], 44300, 28500.022123893807
[READ], 44400, 12167.16489361702
[READ], 44500, 6646.996527777777
[READ], 44600, 29115.386075949365
[READ], 44700, 14042.305147058823
[READ], 44800, 33759.6036036036
[READ], 44900, 4104.869565217391
[READ], 45000, 15872.008333333333
[READ], 45100, 28043.29109589041
[READ], 45200, 28740.789682539682
[READ], 45300, 9114.839416058394
[READ], 45400, 30790.81893004115
[READ], 45500, 20590.848101265823
[READ], 45600, 19299.10034602076
[READ], 45700, 24034.136546184738
[READ], 45800, 18121.342412451362
[READ], 45900, 19167.65134099617
[READ], 46000, 18444.05625
[READ], 46100, 21341.4
[READ], 46200, 21323.331838565024
[READ], 46300, 12236.576158940397
[READ], 46400, 20588.355805243446
[READ], 46500, 12547.400544959128
[READ], 46600, 40854.26271186441
[READ], 46700, 17988.11155378486
[READ], 46800, 23133.5
[READ], 46900, 21393.23465703971
[READ], 47000, 19564.41403508772
[READ], 47100, 22828.7722007722
[READ], 47200, 21237.75939849624
[READ], 47300, 19696.649253731342
[READ], 47400, 18347.16417910448
[READ], 47500, 18280.89383561644
[READ], 47600, 19784.12671232877
[READ], 47700, 14416.625984251968
[READ], 47800, 22966.87966804979
[READ], 47900, 28459.88349514563
[READ], 48000, 15977.53795379538
[READ], 48100, 20466.646288209606
[READ], 48200, 13912.0790513834
[READ], 48300, 5514.4375
[READ], 48400, 16412.144303797468
[READ], 48500, 16394.295833333334
[READ], 48600, 17789.325342465752
[READ], 48700, 11838.827361563517
[READ], 48800, 39075.31228070176
[READ], 48900, 25668.808664259926
[READ], 49000, 8957.187250996016
[READ], 49100, 24066.7578125
[READ], 49200, 20072.179389312976
[READ], 49300, 7811.918644067797
[READ], 49400, 24607.036585365855
[READ], 49500, 18670.512096774193
[READ], 49600, 10089.161073825504
[READ], 49700, 22220.245614035088
[READ], 49800, 12923.316831683169
[READ], 49900, 16520.325203252032
[READ], 50000, 28067.959119496856
[READ], 50100, 19428.49754901961
[READ], 50200, 35209.23931623931
[READ], 50300, 28856.21453287197
[READ], 50400, 21838.198473282442
[READ], 50500, 22537.51798561151
[READ], 50600, 12360.09090909091
[READ], 50700, 14846.15406162465
[READ], 50800, 10920.90395480226
[READ], 50900, 10997.442508710801
[READ], 51000, 6616.82131661442
[READ], 51100, 17079.091254752853
[READ], 51200, 47599.36018957346
[READ], 51300, 17779.399239543727
[READ], 51400, 12806.010204081633
[READ], 51500, 22175.445595854922
[READ], 51600, 18104.39222614841
[READ], 51700, 18054.256
[READ], 51800, 8322.320547945206
[READ], 51900, 31889.083056478405
[READ], 52000, 20643.702290076337
[READ], 52100, 24410.588679245284
[READ], 52200, 25785.2
[READ], 52300, 29095.098113207547
[READ], 52400, 9333.792682926829
[READ], 52500, 15847.337719298246
[READ], 52600, 43703.56653992395
[READ], 52700, 10960.31111111111
[READ], 52800, 14224.299684542586
[READ], 52900, 16625.640127388535
[READ], 53000, 9448.388461538461
[READ], 53100, 15075.607692307693
[READ], 53200, 17400.92531120332
[READ], 53300, 12879.537234042553
[READ], 53400, 20879.786516853932
[READ], 53500, 19305.043137254903
[READ], 53600, 33227.73245614035
[READ], 53700, 6531.405994550409
[READ], 53800, 8867.735
[READ], 53900, 2831.0159574468084
[READ], 54000, 17160.90668523677
[READ], 54100, 3633.204081632653
[READ], 54200, 1649.1422000766577
[CLEANUP], Operations, 60
[CLEANUP], AverageLatency(us), 228.23333333333332
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 13681
[CLEANUP], 0, 228.23333333333332
[UPDATE], Operations, 1592
[UPDATE], AverageLatency(us), 208849.00753768845
[UPDATE], MinLatency(us), 3683
[UPDATE], MaxLatency(us), 865112
[UPDATE], Return=OK, 1592
[UPDATE], 0, 514760.76923076925
[UPDATE], 100, 506594.0
[UPDATE], 200, 519019.85714285716
[UPDATE], 300, 248311.6
[UPDATE], 400, 195339.25
[UPDATE], 500, 158174.0
[UPDATE], 600, 150201.66666666666
[UPDATE], 700, 86996.0
[UPDATE], 800, 105619.0
[UPDATE], 900, 91689.0
[UPDATE], 1000, 142483.5
[UPDATE], 1100, 145242.0
[UPDATE], 1200, 134092.83333333334
[UPDATE], 1300, 86025.25
[UPDATE], 1500, 174484.0
[UPDATE], 1600, 171945.0
[UPDATE], 2200, 553812.3636363636
[UPDATE], 2300, 333845.63636363635
[UPDATE], 2400, 809033.0
[UPDATE], 2500, 257606.125
[UPDATE], 2600, 205414.2
[UPDATE], 2700, 147089.33333333334
[UPDATE], 2900, 157158.0
[UPDATE], 3200, 95940.8
[UPDATE], 3300, 69003.0
[UPDATE], 3400, 92949.5
[UPDATE], 3500, 129012.25
[UPDATE], 3600, 122419.0
[UPDATE], 3800, 75060.83333333333
[UPDATE], 3900, 117325.0
[UPDATE], 4000, 129660.33333333333
[UPDATE], 4100, 93604.66666666667
[UPDATE], 4200, 7314.0
[UPDATE], 4300, 118488.25
[UPDATE], 4400, 81940.25
[UPDATE], 4500, 99816.0
[UPDATE], 4600, 101865.0
[UPDATE], 4700, 99971.11111111111
[UPDATE], 4900, 134463.0
[UPDATE], 5000, 119816.66666666667
[UPDATE], 5200, 90289.0
[UPDATE], 5300, 82570.2
[UPDATE], 5400, 113311.66666666667
[UPDATE], 5500, 66556.0
[UPDATE], 5600, 140290.0
[UPDATE], 5900, 198066.63636363635
[UPDATE], 6000, 143917.0
[UPDATE], 6100, 255469.0
[UPDATE], 6300, 276611.5
[UPDATE], 6400, 156644.14285714287
[UPDATE], 6500, 265651.0
[UPDATE], 6600, 160260.11111111112
[UPDATE], 6700, 198996.8
[UPDATE], 6800, 287841.0
[UPDATE], 6900, 114308.66666666667
[UPDATE], 7100, 219711.0
[UPDATE], 7200, 216964.4
[UPDATE], 7300, 157744.57142857142
[UPDATE], 7400, 99402.5
[UPDATE], 7500, 195347.6
[UPDATE], 7600, 97550.0
[UPDATE], 7800, 147237.0
[UPDATE], 8000, 137914.0
[UPDATE], 8100, 65496.0
[UPDATE], 8200, 90051.4
[UPDATE], 8500, 259820.4
[UPDATE], 8600, 262679.5
[UPDATE], 8700, 151148.0
[UPDATE], 8800, 360343.0
[UPDATE], 8900, 154820.75
[UPDATE], 9000, 79770.0
[UPDATE], 9100, 131229.75
[UPDATE], 9300, 151805.5
[UPDATE], 9400, 99145.7
[UPDATE], 9700, 282873.0
[UPDATE], 9800, 231259.72727272726
[UPDATE], 9900, 249508.0
[UPDATE], 10000, 212346.875
[UPDATE], 10100, 128439.0
[UPDATE], 10200, 144727.6
[UPDATE], 10300, 116223.0
[UPDATE], 10400, 100839.0
[UPDATE], 10700, 252327.0
[UPDATE], 11100, 267732.0
[UPDATE], 11500, 380954.0
[UPDATE], 11700, 394602.3333333333
[UPDATE], 11800, 272759.5833333333
[UPDATE], 11900, 56947.0
[UPDATE], 12100, 180966.66666666666
[UPDATE], 12200, 237523.0
[UPDATE], 12300, 274580.0
[UPDATE], 12400, 371301.25
[UPDATE], 12500, 286371.0
[UPDATE], 12600, 171955.25
[UPDATE], 12700, 135875.75
[UPDATE], 12800, 115126.0
[UPDATE], 13000, 99646.83333333333
[UPDATE], 13100, 107050.0
[UPDATE], 13200, 97169.0
[UPDATE], 13300, 108205.5
[UPDATE], 13500, 334508.0
[UPDATE], 13600, 234559.33333333334
[UPDATE], 13700, 105206.0
[UPDATE], 14100, 469557.0
[UPDATE], 14200, 207043.25
[UPDATE], 14300, 386898.0
[UPDATE], 14600, 280411.0833333333
[UPDATE], 14700, 202552.0
[UPDATE], 14800, 169171.6
[UPDATE], 14900, 120671.0
[UPDATE], 15000, 224008.0
[UPDATE], 15100, 180125.33333333334
[UPDATE], 15200, 122942.33333333333
[UPDATE], 15300, 152281.0
[UPDATE], 15400, 144565.25
[UPDATE], 15500, 162890.5
[UPDATE], 15600, 81209.75
[UPDATE], 15700, 105693.33333333333
[UPDATE], 15800, 42857.5
[UPDATE], 15900, 120456.0
[UPDATE], 16000, 105284.0
[UPDATE], 16200, 153193.5
[UPDATE], 16300, 124881.55555555556
[UPDATE], 16600, 169543.6
[UPDATE], 16800, 344530.3333333333
[UPDATE], 16900, 223982.0
[UPDATE], 17000, 153629.25
[UPDATE], 17100, 128280.0
[UPDATE], 17200, 88628.8
[UPDATE], 17700, 548119.0
[UPDATE], 17800, 366618.28571428574
[UPDATE], 17900, 223078.25
[UPDATE], 18000, 153242.2857142857
[UPDATE], 18100, 150202.0
[UPDATE], 18200, 138761.0
[UPDATE], 18300, 107341.25
[UPDATE], 18400, 127071.0
[UPDATE], 18700, 278328.3333333333
[UPDATE], 18800, 174323.81818181818
[UPDATE], 18900, 72863.5
[UPDATE], 19200, 239709.0
[UPDATE], 19300, 181199.66666666666
[UPDATE], 19400, 81479.16666666667
[UPDATE], 19500, 42805.0
[UPDATE], 19600, 52874.0
[UPDATE], 19900, 321879.0
[UPDATE], 20000, 278098.2
[UPDATE], 20100, 270153.1111111111
[UPDATE], 20200, 183288.0
[UPDATE], 20300, 208792.0
[UPDATE], 20400, 243153.0
[UPDATE], 20500, 104347.0
[UPDATE], 20700, 127535.28571428571
[UPDATE], 20900, 271595.75
[UPDATE], 21000, 79667.0
[UPDATE], 21100, 167849.25
[UPDATE], 21200, 87606.5
[UPDATE], 21300, 119775.0
[UPDATE], 21400, 108379.0
[UPDATE], 21500, 80889.0
[UPDATE], 21700, 108008.57142857143
[UPDATE], 21800, 122616.6
[UPDATE], 21900, 76425.5
[UPDATE], 22000, 93158.75
[UPDATE], 22200, 113415.8
[UPDATE], 22300, 127349.5
[UPDATE], 22500, 159486.6
[UPDATE], 22600, 71252.33333333333
[UPDATE], 22800, 135968.0
[UPDATE], 22900, 130667.0
[UPDATE], 23000, 148923.66666666666
[UPDATE], 23100, 153718.66666666666
[UPDATE], 23200, 123729.71428571429
[UPDATE], 23300, 106422.5
[UPDATE], 23500, 191197.66666666666
[UPDATE], 23700, 216247.75
[UPDATE], 23800, 264356.14285714284
[UPDATE], 23900, 162517.4
[UPDATE], 24300, 460513.0
[UPDATE], 24400, 312780.625
[UPDATE], 24600, 201652.0
[UPDATE], 24900, 311763.0
[UPDATE], 25000, 333137.125
[UPDATE], 25100, 232245.4
[UPDATE], 25200, 138491.125
[UPDATE], 25400, 195515.25
[UPDATE], 25500, 194297.0
[UPDATE], 25600, 128784.5
[UPDATE], 25700, 114914.0
[UPDATE], 25800, 96069.5
[UPDATE], 25900, 113181.0
[UPDATE], 26000, 148012.0
[UPDATE], 26100, 116157.16666666667
[UPDATE], 26300, 120253.0
[UPDATE], 26400, 99072.4
[UPDATE], 26500, 117910.6
[UPDATE], 26600, 70972.4
[UPDATE], 26800, 253460.0
[UPDATE], 26900, 203822.33333333334
[UPDATE], 27200, 212684.5
[UPDATE], 27300, 140845.0
[UPDATE], 27600, 198046.2857142857
[UPDATE], 27700, 262103.83333333334
[UPDATE], 27800, 131897.83333333334
[UPDATE], 27900, 436656.0
[UPDATE], 28100, 172158.91666666666
[UPDATE], 28600, 302481.71428571426
[UPDATE], 29200, 556521.0
[UPDATE], 29300, 438395.76923076925
[UPDATE], 29400, 190621.83333333334
[UPDATE], 29500, 217170.0
[UPDATE], 29600, 372580.0
[UPDATE], 29800, 309119.9
[UPDATE], 29900, 378316.5
[UPDATE], 30000, 149509.33333333334
[UPDATE], 30100, 103065.0
[UPDATE], 30300, 187327.7142857143
[UPDATE], 30400, 116105.5
[UPDATE], 30500, 100109.0
[UPDATE], 30600, 105436.5
[UPDATE], 30700, 245877.0
[UPDATE], 30800, 79300.33333333333
[UPDATE], 31000, 248838.0
[UPDATE], 31100, 244895.0
[UPDATE], 31400, 469001.5
[UPDATE], 31500, 336525.76923076925
[UPDATE], 31600, 158693.0
[UPDATE], 31700, 346983.0
[UPDATE], 31800, 98541.0
[UPDATE], 31900, 106375.0
[UPDATE], 32000, 76791.0
[UPDATE], 32100, 83398.75
[UPDATE], 32200, 104880.14285714286
[UPDATE], 32300, 86391.25
[UPDATE], 32400, 68928.0
[UPDATE], 32800, 269415.8333333333
[UPDATE], 32900, 157696.0
[UPDATE], 33000, 327703.0
[UPDATE], 33100, 434358.5
[UPDATE], 33300, 336762.25
[UPDATE], 33400, 354917.4
[UPDATE], 33500, 280237.0
[UPDATE], 33600, 244620.07142857142
[UPDATE], 33700, 155555.0
[UPDATE], 33900, 262207.0
[UPDATE], 34000, 314353.0
[UPDATE], 34100, 191939.625
[UPDATE], 34200, 100849.875
[UPDATE], 34300, 52131.0
[UPDATE], 34400, 133432.0
[UPDATE], 34700, 357670.5
[UPDATE], 34800, 271729.6666666667
[UPDATE], 35000, 114159.33333333333
[UPDATE], 35100, 86717.0
[UPDATE], 35200, 94546.66666666667
[UPDATE], 35400, 111348.5
[UPDATE], 35600, 245652.0
[UPDATE], 35900, 433541.4285714286
[UPDATE], 36000, 194966.22222222222
[UPDATE], 36100, 80696.14285714286
[UPDATE], 36400, 367632.0
[UPDATE], 36500, 329143.28571428574
[UPDATE], 36600, 305041.0
[UPDATE], 36700, 108933.5
[UPDATE], 36800, 115116.0
[UPDATE], 36900, 226386.66666666666
[UPDATE], 37000, 151899.2
[UPDATE], 37100, 109800.66666666667
[UPDATE], 37200, 80735.2
[UPDATE], 37400, 98294.0
[UPDATE], 37500, 105936.33333333333
[UPDATE], 37600, 131016.75
[UPDATE], 37700, 32373.2
[UPDATE], 38000, 174356.42857142858
[UPDATE], 38100, 231523.0
[UPDATE], 38300, 182948.44444444444
[UPDATE], 38500, 108069.0
[UPDATE], 38700, 229900.0
[UPDATE], 38800, 127510.66666666667
[UPDATE], 38900, 92681.57142857143
[UPDATE], 39100, 176591.0
[UPDATE], 39200, 207146.0
[UPDATE], 39300, 97973.5
[UPDATE], 39400, 89781.85714285714
[UPDATE], 39500, 139402.66666666666
[UPDATE], 39600, 118115.0
[UPDATE], 39800, 127549.4
[UPDATE], 39900, 34378.5
[UPDATE], 40200, 257997.2
[UPDATE], 40300, 147426.0
[UPDATE], 40400, 152660.5
[UPDATE], 40500, 116077.85714285714
[UPDATE], 40700, 122929.6
[UPDATE], 40800, 62370.0
[UPDATE], 40900, 98409.5
[UPDATE], 41000, 100123.66666666667
[UPDATE], 41100, 166043.0
[UPDATE], 41200, 378257.0
[UPDATE], 41300, 291978.5
[UPDATE], 41400, 259097.5
[UPDATE], 41500, 239652.33333333334
[UPDATE], 41600, 201557.25
[UPDATE], 41700, 67416.0
[UPDATE], 42100, 217894.75
[UPDATE], 42300, 237936.0
[UPDATE], 42400, 160518.66666666666
[UPDATE], 42600, 141258.375
[UPDATE], 42700, 53500.0
[UPDATE], 43000, 127774.0
[UPDATE], 43400, 641933.1666666666
[UPDATE], 43800, 568271.8571428572
[UPDATE], 43900, 460832.6
[UPDATE], 44000, 606531.0
[UPDATE], 44100, 631133.0
[UPDATE], 44300, 411403.5
[UPDATE], 44400, 392004.5
[UPDATE], 44500, 439454.8
[UPDATE], 44600, 327146.2
[UPDATE], 44700, 222819.4
[UPDATE], 44800, 121229.5
[UPDATE], 45000, 96060.0
[UPDATE], 45200, 165949.14285714287
[UPDATE], 45400, 162261.0
[UPDATE], 45500, 225563.6
[UPDATE], 45700, 187846.0
[UPDATE], 45800, 230868.33333333334
[UPDATE], 45900, 133450.33333333334
[UPDATE], 46000, 86877.33333333333
[UPDATE], 46100, 83388.5
[UPDATE], 46200, 77328.25
[UPDATE], 46300, 82851.5
[UPDATE], 46400, 106120.25
[UPDATE], 46500, 76039.5
[UPDATE], 46700, 163917.88888888888
[UPDATE], 46800, 85482.0
[UPDATE], 46900, 52250.0
[UPDATE], 47100, 222418.0
[UPDATE], 47300, 58469.0
[UPDATE], 47400, 266626.0
[UPDATE], 47600, 474594.44444444444
[UPDATE], 47700, 376263.0
[UPDATE], 47800, 290844.75
[UPDATE], 47900, 392492.0
[UPDATE], 48300, 189035.0
[UPDATE], 48400, 270780.0
[UPDATE], 48600, 263453.0
[UPDATE], 48700, 87290.4
[UPDATE], 48900, 59231.0
[UPDATE], 49100, 212920.0
[UPDATE], 49200, 227838.57142857142
[UPDATE], 49300, 199031.33333333334
[UPDATE], 49400, 252468.0
[UPDATE], 49500, 143378.125
[UPDATE], 49600, 107260.0
[UPDATE], 50000, 111125.5
[UPDATE], 50100, 28361.0
[UPDATE], 50200, 28140.333333333332
[UPDATE], 50300, 266406.1111111111
[UPDATE], 50400, 758454.0
[UPDATE], 50800, 336125.5
[UPDATE], 50900, 370523.77777777775
[UPDATE], 51000, 225087.0
[UPDATE], 51200, 191262.33333333334
[UPDATE], 51300, 162426.5
[UPDATE], 51400, 88695.5
[UPDATE], 51500, 63276.0
[UPDATE], 51700, 333972.0
[UPDATE], 52100, 42819.0
[UPDATE], 52200, 465186.0
[UPDATE], 52400, 464317.1666666667
[UPDATE], 52700, 430552.0
[UPDATE], 52800, 473067.0
[UPDATE], 53000, 536197.0
[UPDATE], 53100, 382707.1111111111
[UPDATE], 53200, 117387.95
[UPDATE], 53300, 9383.0
[UPDATE], 53400, 7382.333333333333